// Цикл на кожній ітерації пропонує через prompt ввести число більше 100
// (але максимум 10 ітерацій циклу) .
// Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше.
//  Якщо користувач вводить більше ста, текст або цикл закінчує всі ітерації,
// то функція виводить в консоль останній введення користувача і завершує функцію.

for (let i = 0; i < 10; i++) {
  let value = prompt("enter the number>100");
  let number = parseInt(value);

  if (number > 100 || isNaN(number) || i === 9) {
    console.log(value);
    break;
  } else if (number <= 100) {
    console.log("enter the correct number");
  }
}
